products/health-care/application/va-application/Toxic Exposure/Engineering docs/voa_tera_sample_request_with_toxic_exposure.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://va.gov/schema/esr/voa/v1" xmlns:sch="http://jaxws.webservices.esr.med.va.gov/schemas">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:submitFormRequest>
         <form xmlns="http://va.gov/schema/esr/voa/v1" xmlns:ns0="http://jaxws.webservices.esr.med.va.gov/schemas">
		   <formIdentifier>
		      <type>100</type>
		      <value>1010EZ</value>
		      <version>2986360436</version>
		   </formIdentifier>
		   <summary>
		      <ns0:demographics>
		         <ns0:appointmentRequestResponse>false</ns0:appointmentRequestResponse>
		         <ns0:contactInfo>
		            <ns0:addresses>
		               <ns0:address>
		                  <ns0:city>LEESBURG</ns0:city>
		                  <ns0:country>USA</ns0:country>
		                  <ns0:line1>123 TEST STREET</ns0:line1>
		                  <ns0:state>VA</ns0:state>
		                  <ns0:zipCode>20176</ns0:zipCode>
		                  <ns0:addressTypeCode>P</ns0:addressTypeCode>
		               </ns0:address>
		               <ns0:address>
		                  <ns0:city>LEESBURG</ns0:city>
		                  <ns0:country>USA</ns0:country>
		                  <ns0:line1>123 TEST STREET</ns0:line1>
		                  <ns0:state>VA</ns0:state>
		                  <ns0:zipCode>20176</ns0:zipCode>
		                  <ns0:addressTypeCode>R</ns0:addressTypeCode>
		               </ns0:address>
		            </ns0:addresses>
		            <ns0:emails>
		               <ns0:email>
		                  <ns0:address>TEST@TEST.COM</ns0:address>
		                  <ns0:type>1</ns0:type>
		               </ns0:email>
		            </ns0:emails>
		            <ns0:phones>
		               <ns0:phone>
		                  <ns0:phoneNumber>5551234567</ns0:phoneNumber>
		                  <ns0:type>1</ns0:type>
		               </ns0:phone>
		               <ns0:phone>
		                  <ns0:phoneNumber>5551234568</ns0:phoneNumber>
		                  <ns0:type>4</ns0:type>
		               </ns0:phone>
		            </ns0:phones>
		         </ns0:contactInfo>
		         <ns0:ethnicity>0000-0</ns0:ethnicity>
		         <ns0:maritalStatus>S</ns0:maritalStatus>
		         <ns0:preferredFacility>695</ns0:preferredFacility>
		         <ns0:races>
		            <ns0:race>0000-0</ns0:race>
		         </ns0:races>
		         <ns0:acaIndicator>true</ns0:acaIndicator>
		      </ns0:demographics>
		      <ns0:enrollmentDeterminationInfo>
		         <ns0:eligibleForMedicaid>false</ns0:eligibleForMedicaid>
		         <ns0:noseThroatRadiumInfo>
		            <ns0:receivingTreatment>false</ns0:receivingTreatment>
		         </ns0:noseThroatRadiumInfo>
		         <ns0:serviceConnectionAward>
		            <ns0:serviceConnectedIndicator>false</ns0:serviceConnectedIndicator>
		         </ns0:serviceConnectionAward>
		         <ns0:specialFactors>
		            <ns0:agentOrangeInd>false</ns0:agentOrangeInd>
		            <ns0:envContaminantsInd>false</ns0:envContaminantsInd>
		            <ns0:campLejeuneInd>false</ns0:campLejeuneInd>
		            <ns0:radiationExposureInd>false</ns0:radiationExposureInd>
		            <ns0:toxicExposureRiskActivityInd>true</ns0:toxicExposureRiskActivityInd>
					<ns0:toxicExposure>
						<ns0:exposureCategories>
							<ns0:exposureCategory>Other</ns0:exposureCategory>
						</ns0:exposureCategories>
						<ns0:otherText>test</ns0:otherText>
						<ns0:fromDate>01/2000</ns0:fromDate>
						<ns0:toDate>01/2010</ns0:toDate>
					</ns0:toxicExposure>
		         </ns0:specialFactors>
		      </ns0:enrollmentDeterminationInfo>
		      <ns0:prisonerOfWarInfo>
		         <ns0:powIndicator>false</ns0:powIndicator>
		      </ns0:prisonerOfWarInfo>
		      <ns0:purpleHeart>
		         <ns0:indicator>false</ns0:indicator>
		      </ns0:purpleHeart>
		      <ns0:personInfo>
		         <ns0:firstName>ONE</ns0:firstName>
		         <ns0:middleName></ns0:middleName>
		         <ns0:lastName>TERAVOATEST</ns0:lastName>
		         <ns0:ssnText>897280001</ns0:ssnText>
		         <ns0:gender>F</ns0:gender>
		         <ns0:dob>01/01/1980</ns0:dob>
		         <ns0:mothersMaidenName></ns0:mothersMaidenName>
		         <ns0:placeOfBirthCity>LEESBURG</ns0:placeOfBirthCity>
		         <ns0:placeOfBirthState>VA</ns0:placeOfBirthState>
		      </ns0:personInfo>
		   </summary>
		   <applications>
		      <applicationInfo>
		         <appDate>2024-02-15</appDate>
		         <appMethod>1</appMethod>
		      </applicationInfo>
		   </applications>
		</form>
         <v1:identity>
            <v1:authenticationLevel>
               <v1:type>100</v1:type>
               <v1:value>Anonymous</v1:value>
            </v1:authenticationLevel>
         </v1:identity>
      </v1:submitFormRequest>
   </soapenv:Body>
</soapenv:Envelope>